/*
Створити CRUD-додаток (Create, Read, Update, Delete):

Виводиться список користувачів із кнопками “Edit”, “Remove”, “View” біля кожного користувача (use data-id attributes або event delegation) -----DONE
список користувачів отримувати з js-файлу (масив об'єктів / використовувати функції-конструктори – за бажанням)-----DONE

--При натисканні на кнопку “View” відкриваються дані користувача у блоці під списком
--При натисканні на кнопку “Edit” з'являється можливість редагувати дані в блоці під списком. Дані зберігаються при натисканні на кнопку “Save” та оновлюють дані у списку
--Бажано перевикористовувати форму редагування
--Валидация

--При натисканні на кнопку “Remove” користувач видаляється зі списку----------DONE
--Обов'язково підтвердження видалення (для уникнення видалення помилково)------DONE
--Реалізувати можливість додавання нових користувачів-----DONE
--При додаванні користувач з'являється у списку------DONE
--Після перезавантаження сторінки всі зміни повинні зберігатись (використовувати localStorage)----DONE
*/

const defaultUsers = [
    {
        id: 1,
        login: 'Helen',
        name: 'Helen',
        lastName: 'Jevago',
        email: 'helen.j@gmail.com',
    },
    {
        id: 2,
        login: 'John',
        name: 'John',
        lastName: 'Smith',
        email: 'john.doe@gmail.com',
    },
    {
        id: 3,
        login: 'Rodrigo',
        name: 'Rodrigo',
        lastName: 'Gonzales',
        email: 'rodrigo.g@gmail.com',
    },
    {
        id: 4,
        login: 'Jack',
        name: 'Jack',
        lastName: 'Sparrow',
        email: 'jack.s@gmail.com',
    },
]



























